/* card commands displayed in menu bar */

"Power off Card" = "Sammuta kortti";
"Power on Card" = "Käynnistä kortti";
"Open ExpressCard" = "Avaa ExpressCard…";

/* card descriptions for cards we can not figure out */

"Unknown Vendor" = "Tuntematon valmistaja";
"Unknown Card Type" = "Tuntematon korttityyppi";

/* card descriptions for PCI Class Codes */

"ClassCode00" = "Vanha laite";
"ClassCode0001" = "VGA-yhteensopiva laite";

"ClassCode01" = "Tallennuslaitteen ohjain";
"ClassCode0100" = "SCSI-ohjain";
"ClassCode0101" = "IDE-ohjain";
"ClassCode0102" = "Levykeohjain";
"ClassCode0103" = "IPI-ohjain";
"ClassCode0104" = "RAID-ohjain";
"ClassCode0105" = "ATA-ohjain";
"ClassCode0106" = "SATA-ohjain";
"ClassCode0107" = "SAS-ohjain";

"ClassCode02" = "Verkko-ohjain";
"ClassCode0200" = "Ethernet-ohjain";
"ClassCode0201" = "Token Ring -ohjain";
"ClassCode0202" = "FDDI-ohjain";
"ClassCode0203" = "ATM-ohjain";
"ClassCode0204" = "ISDN-ohjain";
"ClassCode0205" = "WorldFip-ohjain";
"ClassCode0206" = "PICMG 2.14 -moniprosessointi";

"ClassCode03" = "Näyttöohjain";

"ClassCode04" = "Multimedialaite";

"ClassCode05" = "Muistiohjain";

"ClassCode06" = "Siltalaite";
"ClassCode0600" = "Järjestelmäsilta";
"ClassCode0601" = "ISA-silta";
"ClassCode0602" = "EISA-silta";
"ClassCode0603" = "MCA-silta";
"ClassCode0604" = "PCI–PCI-silta";
"ClassCode0605" = "PCMCIA-silta";
"ClassCode0606" = "NuBus-silta";
"ClassCode0607" = "CardBus-silta";
"ClassCode0608" = "RACEway-silta";
"ClassCode0609" = "PCI–PCI-silta";
"ClassCode060a" = "InfiniBand–PCI-silta";

"ClassCode07" = "Yksinkertainen tietoliikenneohjain";
"ClassCode0700" = "Sarjaohjain";
"ClassCode0701" = "Rinnakkaisportin ohjain";
"ClassCode0702" = "Moniporttinen sarjaohjain";
"ClassCode0703" = "Modeemiohjain";
"ClassCode0704" = "GPIB-ohjain";
"ClassCode0705" = "Älykortti";

"ClassCode08" = "Pohjajärjestelmän lisälaite";
"ClassCode0804" = "PCI Hot-Plug -ohjain";

"ClassCode09" = "Syöttölaitteen ohjain";
"ClassCode0900" = "Näppäimistöohjain";
"ClassCode0901" = "Digitointiohjain";
"ClassCode0902" = "Hiiriohjain";
"ClassCode0903" = "Skanneriohjain";
"ClassCode0904" = "Peliportin ohjain";

"ClassCode0a" = "Telakka";

"ClassCode0b" = "Lisäprosessori";

"ClassCode0c" = "Sarjaväylän ohjain";
"ClassCode0c00" = "FireWire-ohjain";
"ClassCode0c01" = "ACCESS.bus-ohjain";
"ClassCode0c02" = "SSA-ohjain";
"ClassCode0c03" = "USB-ohjain";
"ClassCode0c04" = "Fibre Channel -ohjain";
"ClassCode0c05" = "SMBus-ohjain";
"ClassCode0c06" = "InfiniBand-ohjain";
"ClassCode0c07" = "IPMI-ohjain";
"ClassCode0c08" = "SERCOS-ohjain";
"ClassCode0c09" = "CANbus-ohjain";

"ClassCode0d" = "Langaton ohjain";
"ClassCode0d00" = "iRDa-ohjain";
"ClassCode0d01" = "Kuluttajaelektroniikan infrapunaohjain";
"ClassCode0d10" = "RF-ohjain";
"ClassCode0d11" = "Bluetooth-ohjain";
"ClassCode0d12" = "Laajakaistaohjain";
"ClassCode0d20" = "Wi-Fi-ohjain 5 GHz";
"ClassCode0d21" = "Wi-Fi-ohjain 2,4 GHz";

"ClassCode0e" = "Älykäs I/O-ohjain";

"ClassCode0f" = "Satelliittiviestintäohjain";

"ClassCode10" = "Salausohjain";

"ClassCode11" = "Tiedonkeruuohjain";
